[
  {
    "Id": "998977",
    "ThreadId": "432586",
    "Html": "Please post suggestion and feedback for that demo site here. <br />\n<br />\n<a href=\"http://kamocu.com/en/qrcode/\" rel=\"nofollow\">http://kamocu.com/en/qrcode/</a><br />\n",
    "PostedDate": "2013-02-09T12:32:07.283-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "999473",
    "ThreadId": "432586",
    "Html": "That online demo is a way to quickly verify (without having to compile anything) how the QrCode.Net library is working and test the generated codes with scanners.\r<br />\nI plan to add more features soon, like supporting more content formats (vCard, geolocalization, ...) and generate colored codes. Feel free to submit your ideas.\r<br />\n<br />\nIf there is demand I will add the source code of a web application sample (actually the server-side of this demo as the client-side is already readable).<br />\n",
    "PostedDate": "2013-02-11T01:11:43.487-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1003186",
    "ThreadId": "432586",
    "Html": "I was just using the website for some quick tests and think the source for the actual website would be very helpful as part of the documentation or sample downloads. I took a peek and saw that you were using AJAX and the images could be generated as streams from query strings, which is also another great usage.\r<br />\n<br />\n<a href=\"http://kamocu.com/qrcode.ashx?e=M&amp;q=Zero&amp;optimize=true&amp;t=http%3A%2F%2Fgoo.gl%2Fidb32\" rel=\"nofollow\">http://kamocu.com/qrcode.ashx?e=M&q=Zero&optimize=true&t=http%3A%2F%2Fgoo.gl%2Fidb32</a>\r<br />\n<br />\nThese will be useful for the community as a whole, and I am looking into using these QR Codes as part of printed material to guide users back to the website it was printed from... Very excited and excellent work!!<br />\n",
    "PostedDate": "2013-02-18T21:41:55.837-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1003351",
    "ThreadId": "432586",
    "Html": "You should not rely on the current query string structure as it is subject to change. But the web application sample I plan to add will certainly have this kind of plain API. The sample must be easy to understand and reuse so I will remove all the fancy things I'm testing now.\r<br />\n<br />\nThe online service will always be available for the community, but because of limited server resources I will have to limit the number of requests by user. It should not be used live in a production environment.<br />\n",
    "PostedDate": "2013-02-19T03:24:42.14-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1003550",
    "ThreadId": "432586",
    "Html": "For generate button, probably can replace with some sort of simple throttle mechanism. \r<br />\n<br />\nWith angular, you can submit ngchange event, on every ngchange save a Date.Now(). And also fire up a timed event, to execute ajax request after 1 sec. \r<br />\n<br />\nOnce event fire up and saved timer still 1 sec ago, request ajax call to get image, else ignore it.  But time might be a bit short for slow typing people, also server stress is also much higher than button. \r<br />\n<br />\n<br />\nFor people who in hurry and interest at grab image as string and query related stuff before iMarti finish up his code. You can check WebAPI's official tutorial, that cover up all request and send back. To display string as image, check out turn stream into base64 format and display under &lt;img&gt; tab. There are some simple src mark up for let browser know internally is base64 image. \r<br />\n<br />\nWhile you can also request for SVG string and present in webpage's DOM. If use angular just use html unsafe insert will do. That case is faster than transfer raw image, can be useful if there is no need for user to save the file. <br />\n",
    "PostedDate": "2013-02-19T09:46:17.833-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1005160",
    "ThreadId": "432586",
    "Html": "I just added a new demo project Gma.QrCodeNet.Web.Demo generating QR code images for the web.\r<br />\n<br />\nThe images are generated by an HttpHandler getting parameters through the Query String.\r<br />\n<br />\nThe current two sample pages have as few dependency as possible (no external JS library). I just used the Twitter Bootstrap CSS for layout, but it can be removed without consequence.<br />\n",
    "PostedDate": "2013-02-22T03:46:54.933-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1046248",
    "ThreadId": "432586",
    "Html": "Nice demo. I would like the source code if possible.  Did you build it in MVC 4?<br />\n",
    "PostedDate": "2013-05-20T17:23:24.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1046338",
    "ThreadId": "432586",
    "Html": "Thanks.\r<br />\nThe server-side code is very similar to the Gma.QrCodeNet.Web.Demo sample provided here. It is only an ASP.NET ASHX handler returning QR Code images.\r<br />\n<br />\nThe client-side code is built using the <a href=\"http://angularjs.org/\" rel=\"nofollow\">AngularJS JavaScript Framevork</a>. As the code is not minified, you can view the sources and download them from the demo site.<br />\n",
    "PostedDate": "2013-05-21T00:09:40.123-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1345209",
    "ThreadId": "432586",
    "Html": "Was just now using the website and found that while it does generate a QR code, when I attempt to download it in EPS format by clicking on the link I get a server error. Can this be resolved?\r<br />\n<br />\nHaving access to a vector version of a QR code would be perfect for embedding in a PS form I'm working on.\r<br />\n<br />\nThanks for your help!<br />\n",
    "PostedDate": "2015-01-22T13:27:53.643-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1345946",
    "ThreadId": "432586",
    "Html": "You're right, I'll check that. At first sight it looks like an IIS configuration error.<br />\n",
    "PostedDate": "2015-01-26T14:17:18.243-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1346000",
    "ThreadId": "432586",
    "Html": "EPS export is working again.\r<br />\nThe error was while writing the MemoryStream content to Response.OutputStream, something that was working before but was now generating an access to the stream after if has been closed.<br />\n",
    "PostedDate": "2015-01-26T15:48:34.593-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1346356",
    "ThreadId": "432586",
    "Html": "Wow - thanks for the quick response!  The export worked great - just what I needed.<br />\n",
    "PostedDate": "2015-01-27T09:15:13.483-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]